Repository: EVAyo/SauceNAObot
Catalog: src/SauceNao.Core/Resources/BotMessages.*.resx
Languages: id, zh_hans

# About
source: This bot provides you with an interface to use <a href="https://saucenao.com/">SauceNAO</a>'s reverse image search engine. Send me an image (image, GIF or a sticker) and I'll try to reverse search using the SauceNAO API. This bot was created by a third party to use SauceNAO on Telegram. The project has not any affiliation with Xamayon (the creator of SauceNAO).
id: Bot ini memberi Anda antarmuka untuk menggunakan mesin pencari gambar terbalik <a href="https://saucenao.com/"> SauceNAO </a>. Kirimi saya gambar (gambar, GIF, atau STIKER) dan saya akan mencoba melakukan pencarian terbalik menggunakan API SauceNAO. This bot was created by a third party to use SauceNAO on Telegram. The project has not any affiliation with Xamayon (the creator of SauceNAO).
zh_hans: SauceNAObot 为您提供了一个界面来使用反向图像搜索引擎 <a href="https://saucenao.com/"> SauceNAO </a>。 向我发送图像（图像、GIF 或 STICKER），我将尝试使用 SauceNAO API 查找来源。 This bot was created by a third party to use SauceNAO on Telegram. The project has not any affiliation with Xamayon (the creator of SauceNAO).

# Anticheats
source: Use this feature to block the reverse search of images sent by specific bots in your group chats. To add a bot to AntiCheat list, just reply to a message sent by the bot with <code>/anticheats add</code>. To remove the bot, reply to the message with <code>/anticheats remove </code>.
id: Gunakan fitur ini untuk memblokir pencarian terbalik dari gambar yang dikirim oleh bot tertentu dalam obrolan grup Anda. Untuk menambahkan bot ke daftar, balas pesan yang dikirim oleh bot dengan <code>/anticheats add</code>. Untuk menghapus bot dari daftar, balas pesan yang dikirim oleh bot dengan <code>/anticheats remove</code>.
zh_hans: 使用此功能可以避免在群聊中对特定机器人发送的图像进行反向查找。 To add a bot to AntiCheat list, just reply to a message sent by the bot with <code>/anticheats add</code>. To remove the bot, reply to the message with <code>/anticheats remove </code>.

# AnticheatsAdded
source: Bot @{0} was added to the AntiCheats list.
id: Bot {0} telah ditambahkan ke daftar Anti-Cheat.
zh_hans: Bot {0} 已添加到反作弊列表中。

# AnticheatsAlreadyExists
source: Bot @{0} already exists in AntiCheats list.
id: Bot {0} sudah ada di daftar Anti-Cheat.
zh_hans: Bot {0} 已存在于反作弊列表中。

# AnticheatsDeleted
source: Bot @{0} was removed from the AntiCheats list.
id: Bot {0} telah dihapus dari daftar Anti-Cheat.
zh_hans: Bot {0} 已从反作弊列表中删除。

# AnticheatsDoesNotExist
source: Bot @{0} doesn't exist in the AntiCheats list.
id: Bot {0} tidak ada dalam daftar Anti-Cheat.
zh_hans: Bot {0} 不存在于反作弊列表中。

# AnticheatsMessage
source: Ups, no cheating, my friend.
id: Wow, tidak ada kecurangan, sobat.
zh_hans: 哇，没有作弊，伙计。

# AntiCheatsNotABot
source: The target user isn't a bot.
id: Pengguna yang ditentukan bukan bot.
zh_hans: 目标用户不是机器人。

# ApiKey
source: If you're already supporting <a href="https://www.patreon.com/saucenao">Xamayon</a> (the original creator of saucenao.com), then you can configure the bot to use your own API key to get your sauces instead of using shared API keys. <code>/apikey status</code> - Check the status of your saved api key. <code>/apikey set &lt;your api key&gt;</code> - Save your API Plus key. Don't use free API keys or it will cause problems for you. <code>/apikey delete</code> - Delete your saved api key.
id: If you are already supporting <a href="https://www.patreon.com/saucenao">Xamayon</a> (the original creator of saucenao.com), then you can configure the bot to use your own API key to get your sauces instead of using shared API keys. <code>/apikey status</code> - Check the status of your saved api key. <code>/apikey set &lt;your api key&gt;</code> - Save your API Plus key. Do not use free API keys or it will cause problems for you. <code>/apikey delete</code> - Delete your saved api key.
zh_hans: If you are already supporting <a href="https://www.patreon.com/saucenao">Xamayon</a> (the original creator of saucenao.com), then you can configure the bot to use your own API key to get your sauces instead of using shared API keys. <code>/apikey status</code> - Check the status of your saved api key. <code>/apikey set &lt;your api key&gt;</code> - Save your API Plus key. Do not use free API keys or it will cause problems for you. <code>/apikey delete</code> - Delete your saved api key.

# ApiKeyDeleted
source: The saved api key has been deleted.
id: Kunci API yang disimpan telah dihapus.
zh_hans: 已保存的 API 密钥已被删除。

# ApiKeyNew
source: Done! The Bot will use your API key from now on. To delete it, use <i>/apikey delete</i>.
id: Selesai! Bot akan menggunakan kunci API Anda mulai sekarang. Untuk menghapusnya, gunakan <i>/apikey delete</i>.
zh_hans: 完成的！ 从现在开始，机器人将使用您的 API 密钥。 要删除它，请使用 <i>/apikey delete</i>。

# ApiKeyNone
source: There is no api key configured.
id: Tidak ada kunci API yang dikonfigurasi.

# Busy
source: SauceNao is very busy right now. Please try again later or try using /temp command. If this message appears frequently, please check the <a href="{0}">support chat</a>.
id: SauceNao agak jenuh saat ini. Silakan coba lagi nanti atau coba gunakan perintah /temp. Jika pesan ini sering muncul, lihat <a href="{0}">Obrolan Dukungan</a>.

# BuyMeACookie
source: Your contributions are used to pay for the bot's hosting and the shared account that we use to search for your sauces. If you have any other questions, ask in the support chat. - <a href="https://www.buymeacoffee.com/eptagone">Buy me a cookie!</a> - <b>Bitcoin:</b> <a href="bitcoin:BC1Q0W43TPRJN80ZN248K7XLZTU7LVHKZGY6DAK8MT?label=MyCoffe&message=Invite%20me%20for%20a%20coffee">bc1q0w43tprjn80zn248k7xlztu7lvhkzgy6dak8mt</a> - <b>Toncoin:</b> <a href="ton://transfer/EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY">EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY</a> Note: Please be sure to confirm the amount you will donate. We don't make refunds.
id: Kontribusi Anda digunakan untuk membayar hosting bot dan akun bersama yang kami gunakan untuk menemukan sumber Anda. Jika Anda memiliki pertanyaan lain, tanyakan di obrolan dukungan. - <a href="https://www.buymeacoffee.com/eptagone">Buy me a cookie!</a> - <b>Bitcoin:</b> <a href="bitcoin:BC1Q0W43TPRJN80ZN248K7XLZTU7LVHKZGY6DAK8MT?label=MyCoffe&message=Invite%20me%20for%20a%20coffee">bc1q0w43tprjn80zn248k7xlztu7lvhkzgy6dak8mt</a> - <b>Toncoin:</b> <a href="ton://transfer/EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY">EQC3SWZxs_4ive2aD-njns1KnB4S2RUgaxDKJ7X44VA52SsY</a> Note: Please be sure to confirm the amount you will donate. We don't make refunds.

# Creator
source: My creator is <a href="tg://user?id=418909573">Derek Nieves</a>.
id: Pencipta saya adalah <a href="tg://user?id=418909573">Derek Nieves</a>.
zh_hans: 我的创作者是 <a href="tg://user?id=418909573">Derek Nieves</a>

# EmptyRequest
source: You need to reply to an image file (image, GIF or a sticker)
id: Anda perlu membalas file gambar (gambar, GIF, atau STIKER)

# FailedConvertFile
source: Failed to convert file to a supported file.
id: File tidak dapat dikonversi ke file yang kompatibel.
zh_hans: 无法将文件转换为兼容文件。

# GeneratingTmpUrl
source: Generating temporary link...
id: Membuat tautan sementara...
zh_hans: 正在生成临时链接...

# GroupsOnly
source: This command only works in group chats.
id: Perintah ini hanya berfungsi dalam obrolan grup.
zh_hans: 该命令只能在群聊中使用。

# History
source: You can send images with sauce from your recent history via bot. The history will be erased periodically. If you want to delete your history right now, type <code> /history clear</code>.
id: Anda dapat mengirimkan gambar dengan sumber Anda dari riwayat terbaru Anda melalui bot ini. Sejarah akan dihapus secara berkala. Jika Anda ingin menghapus riwayat Anda sekarang, ketik <code>/hapus riwayat</code>.

# HistoryButton
source: View search history
id: Lihat riwayat pencarian
zh_hans: 查看搜索历史

# HistoryErased
source: Your history has been erased. Inline search results can take a few minutes to disappear because they are cached.
id: Riwayat Anda telah dihapus. Inline search results can take a few minutes to disappear because they are cached.
zh_hans: 您的历史记录已被删除。 在线搜索结果可能需要几分钟才能消失，因为它们已被缓存。

# MissingParams
source: You have not specified sufficient parameters to use this function.
id: Anda belum menentukan parameter yang cukup untuk menggunakan fungsi ini.
zh_hans: 您没有指定足够的参数来使用此函数。

# NotFound
source: No sauce found. Maybe try <a href="{0}">Google Reverse Search</a> or <a href="{1}">Yandex</a> instead? or see on <a href="{2}">SauceNAO website</a> to see all the results.
id: Tidak ada hasil yang ditemukan. Mungkin Anda ingin mencoba <a href="{0}">Reverse Google Search </a> atau <a href="{1}"> Yandex </a> sebagai gantinya? atau kunjungi situs web <a href="{2}"> SauceNAO </a> untuk melihat semua hasilnya.
zh_hans: 未找到结果。 也许您想尝试使用 <a href="{0}">Google 反向搜索 </a>或<a href="{1}">Yandex</a>代替？ 或查看<a href="{2}">SauceNAO</a> 网站以查看所有结果。

# ResultCharacter
source: Character
id: Karakter
zh_hans: 人物

# ResultCharacters
source: Characters
id: Karakter-karakter

# ResultCreator
source: Creator
id: Pencipta
zh_hans: 创造者

# ResultPart
source: Part
id: Bagian
zh_hans: 部分

# ResultYear
source: Year
id: Tahun
zh_hans: 年

# SetLang
source: Use this command to change the reply language in the current chat. Not all languages are available. <b>Syntax:</b> <code>/setlang <language code> [-Force]</code> Specify the optional [-Force] parameter to keep your language in any group regardless of the group's language.
id: Gunakan perintah ini untuk mengubah bahasa balasan dalam obrolan saat ini. Tidak semua bahasa tersedia. Sintaksis: /setlang <kode bahasa> [-Force] Tentukan parameter [-Force] opsional untuk mempertahankan bahasa Anda di grup mana pun, apa pun bahasa grupnya.
zh_hans: 使用此命令可以更改当前聊天中的回复语言。 句法： /setlang &lt;语言代码&gt; [-Force] 可用的语言是： * 英语（默认）：en * 西班牙语：es * 简体中文：zh-hans * 印尼语：id 指定可选的 [-Force] 参数以将您的语言保留在任何组中，而不管组的语言如何。

# SetLangSaved
source: Your language preferences have been saved.
id: Preferensi bahasa Anda telah disimpan.
zh_hans: 您的语言首选项已保存。

source: Source
id: Sumber
zh_hans: 来源

source: Support Chat
id: Grup pendukung
zh_hans: 支持聊天

# TemporalUrlDone
source: Done! Check your <a href="{0}">temp url</a>.
id: Selesai! Coba <a href="{0}">tautan sementara</a> Anda.
zh_hans: 完成的！ 试试你的 <a href="{0}">临时链接</a>。

# TooBigFile
source: The search could not be performed. The file size is too large.
id: Pencarian tidak dapat dilakukan. Ukuran file terlalu besar.

# Statistics
source: <b>Usage statistics</b> {0} successful searches in the last week. Actively used by {1} users. Used by {2} groups.
id: <b>Estadísticas de uso</b> {0} búsquedas exitosas en la última semana. Usado activamente por {1} usuarios. Usado por {2} grupos
zh_hans: <b>Usage Statistics</b> {0} successful searches in the last 40 days. Used by {1} active users. Used by {2} groups.

# ApiKeyStatus
source: <b>Bot is configured to use the follow api key:</b> {0}
zh_hans: <b>机器人配置为使用以下 API 密钥</b> {0}

# Help
source: Send me an image file (image, GIF or a sticker) to find it's sauce right now. (source) <i>If I'm in a group, reply to an image with /sauce </i>. Forward the media files you have searched along with their sauce via bot. More Info: <code>/help MyHistory</code>. Use my Anti-Cheat feature in your groups when playing "Guess the Character". More Info: <code>/help AntiCheats</code>
zh_hans: 向我发送图像文件（图像、GIF 或 STICKER）以查找其来源。 <i>If I'm in a group, reply to an image with /sauce </i>. Forward the media files you have searched along with their sauce via bot. More Info: <code>/help MyHistory</code>. Use my Anti-Cheat feature in your groups when playing "Guess the Character". More Info: <code>/help AntiCheats</code>

# InvalidPhoto
source: That doesn't look like a photo file.
zh_hans: 那看起来不像图像文件。

# ResultMaterial
source: Material
zh_hans: 材料
